chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
#include "lwip/sys.h"
#include "lwip/tcpip.h"
#include "network_events.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "eth_ipstack_main.h"
#include "ethif_mac.h"

#include "bsp_ethernet.h"
#include "hal_mac_async.h"
#include "hal_gpio.h"
#include "bsp_phy.h"
#include "printf.h"
#include "ieee8023_mii_standard_config.h"
#include "same54p20a.h"
#include <string.h>
#include <hri_mclk_e54.h>
#include <hri_gclk_e54.h>
#include "app_libs/asf4/hri/hri_gmac_e54.h"

/* Redefine ASF4 ERR_TIMEOUT after lwIP to avoid conflicts */
#undef ERR_TIMEOUT
#define ASF4_ERR_TIMEOUT -8

#include "utils_assert.h"

/* Forward declaration of gmac_device - moved from webserver_tasks.h for encapsulation */
typedef struct tag_gmac_device {
    /** Reference to lwIP netif structure. */
    struct netif *netif;

#if NO_SYS == 0
    /** RX task notification semaphore. */
    sys_sem_t rx_sem;
#endif
} gmac_device;

/* Task constants - replicated from webserver_tasks.h to avoid dependency */
#define TASK_LED_STACK_SIZE (512 / sizeof(portSTACK_TYPE))
#define TASK_LED_TASK_PRIORITY (tskIDLE_PRIORITY + 1)
#define netifINTERFACE_TASK_STACK_SIZE 512
#define netifINTERFACE_TASK_PRIORITY (tskIDLE_PRIORITY + 2)

/* Local pin definitions (copied from atmel_start_pins.h to avoid dependency) */
#define PA12 GPIO(GPIO_PORTA, 12)
#define PA13 GPIO(GPIO_PORTA, 13)
#define PA14 GPIO(GPIO_PORTA, 14)
#define PA15 GPIO(GPIO_PORTA, 15)
#define PA17 GPIO(GPIO_PORTA, 17)
#define PA18 GPIO(GPIO_PORTA, 18)
#define PA19 GPIO(GPIO_PORTA, 19)
#define PC11 GPIO(GPIO_PORTC, 11)
#define PC12 GPIO(GPIO_PORTC, 12)
#define PC20 GPIO(GPIO_PORTC, 20)

/* Local PIN and MUX definitions for GMAC (extracted from same54p20a.h) */
#define PIN_PC11L_GMAC_GMDC            _L_(75)
#define MUX_PC11L_GMAC_GMDC            _L_(11)
#define PIN_PC12L_GMAC_GMDIO           _L_(76)
#define MUX_PC12L_GMAC_GMDIO           _L_(11)
#define PIN_PA13L_GMAC_GRX0            _L_(13)
#define MUX_PA13L_GMAC_GRX0            _L_(11)
#define PIN_PA12L_GMAC_GRX1            _L_(12)
#define MUX_PA12L_GMAC_GRX1            _L_(11)
#define PIN_PC20L_GMAC_GRXDV           _L_(84)
#define MUX_PC20L_GMAC_GRXDV           _L_(11)
#define PIN_PA15L_GMAC_GRXER           _L_(15)
#define MUX_PA15L_GMAC_GRXER           _L_(11)
#define PIN_PA18L_GMAC_GTX0            _L_(18)
#define MUX_PA18L_GMAC_GTX0            _L_(11)
#define PIN_PA19L_GMAC_GTX1            _L_(19)
#define MUX_PA19L_GMAC_GTX1            _L_(11)
#define PIN_PA14L_GMAC_GTXCK           _L_(14)
#define MUX_PA14L_GMAC_GTXCK           _L_(11)
#define PIN_PA17L_GMAC_GTXEN           _L_(17)
#define MUX_PA17L_GMAC_GTXEN           _L_(11)

/* Local PINMUX definitions */
#define PINMUX_PC11L_GMAC_GMDC     ((PIN_PC11L_GMAC_GMDC << 16) | MUX_PC11L_GMAC_GMDC)
#define PINMUX_PC12L_GMAC_GMDIO    ((PIN_PC12L_GMAC_GMDIO << 16) | MUX_PC12L_GMAC_GMDIO)
#define PINMUX_PA13L_GMAC_GRX0     ((PIN_PA13L_GMAC_GRX0 << 16) | MUX_PA13L_GMAC_GRX0)
#define PINMUX_PA12L_GMAC_GRX1     ((PIN_PA12L_GMAC_GRX1 << 16) | MUX_PA12L_GMAC_GRX1)
#define PINMUX_PC20L_GMAC_GRXDV    ((PIN_PC20L_GMAC_GRXDV << 16) | MUX_PC20L_GMAC_GRXDV)
#define PINMUX_PA15L_GMAC_GRXER    ((PIN_PA15L_GMAC_GRXER << 16) | MUX_PA15L_GMAC_GRXER)
#define PINMUX_PA18L_GMAC_GTX0     ((PIN_PA18L_GMAC_GTX0 << 16) | MUX_PA18L_GMAC_GTX0)
#define PINMUX_PA19L_GMAC_GTX1     ((PIN_PA19L_GMAC_GTX1 << 16) | MUX_PA19L_GMAC_GTX1)
#define PINMUX_PA14L_GMAC_GTXCK    ((PIN_PA14L_GMAC_GTXCK << 16) | MUX_PA14L_GMAC_GTXCK)
#define PINMUX_PA17L_GMAC_GTXEN    ((PIN_PA17L_GMAC_GTXEN << 16) | MUX_PA17L_GMAC_GTXEN)

/* External peripheral descriptors */
extern struct mac_async_descriptor COMMUNICATION_IO;

/* External PHY driver instance - defined in bsp_phy.c */
extern drv_phy_t phy_0;

/* Network interface variables - now part of driver context */

// Convert ASF4 error codes to driver status
static drv_eth_status_t convert_error_code(int32_t asf4_error)
{
    switch (asf4_error) {
        case ERR_NONE:
            return DRV_ETH_STATUS_OK;
        case ERR_BUSY:
            return DRV_ETH_STATUS_BUSY;
        case ASF4_ERR_TIMEOUT:
            return DRV_ETH_STATUS_TIMEOUT;
        default:
            return DRV_ETH_STATUS_ERROR;
    }
}

typedef struct
{
    struct mac_async_descriptor *mac_desc;
    drv_phy_t *phy_driver;
    drv_eth_callback_t receive_callback;
    drv_eth_callback_t transmit_callback;
    
    // GMAC device context (moved from webserver_tasks.c)
    gmac_device gmac_dev;
    
    // Link status tracking
    bool link_up;
    volatile bool recv_flag;
    
    // Link monitoring task
    TaskHandle_t link_monitor_task;
} drv_eth_hw_context_t;

static drv_eth_hw_context_t drv_eth_hw_context_communication = {
    .mac_desc = &COMMUNICATION_IO,
    .phy_driver = &phy_0,
    .receive_callback = NULL,
    .transmit_callback = NULL,
    .gmac_dev = {0},
    .link_up = false,
    .recv_flag = false,
    .link_monitor_task = NULL,
};

// Forward declarations of static functions
static void gmac_clock_init(void);
static void gmac_pin_init(void);
static void mac_receive_cb(struct mac_async_descriptor *desc);
static void gmac_handler_cb(void);
static void gmac_task(void *pvParameters);
static void link_monitor_task(void *p);
static drv_eth_status_t drv_eth_init(const void *hw_context);
static drv_eth_status_t drv_eth_deinit(const void *hw_context);
static drv_eth_status_t drv_eth_enable(const void *hw_context);
static drv_eth_status_t drv_eth_disable(const void *hw_context);
static drv_eth_status_t drv_eth_phy_init(const void *hw_context);
static drv_eth_status_t drv_eth_phy_reset(const void *hw_context);
static drv_eth_status_t drv_eth_get_link_status(const void *hw_context, bool *link_up);
static drv_eth_status_t drv_eth_restart_autoneg(const void *hw_context);
static drv_eth_status_t drv_eth_read_phy_reg(const void *hw_context, uint16_t reg, uint16_t *value);
static drv_eth_status_t drv_eth_write_phy_reg(const void *hw_context, uint16_t reg, uint16_t value);
static drv_eth_status_t drv_eth_register_callback(const void *hw_context, drv_eth_cb_type_t type, drv_eth_callback_t callback);
static drv_eth_status_t drv_eth_write(const void *hw_context, const uint8_t *data, uint32_t length);
static drv_eth_tcpip_init_done_fn drv_eth_get_tcpip_init_done_fn_impl(const void *hw_context);
static drv_eth_status_t drv_eth_start_link_monitor_impl(const void *hw_context);
static drv_eth_status_t drv_eth_stop_link_monitor_impl(const void *hw_context);

// Global Ethernet driver instance
drv_eth_t eth_communication = {
    .is_init = false,
    .is_enabled = false,
    .hw_context = &drv_eth_hw_context_communication,
    .init = drv_eth_init,
    .deinit = drv_eth_deinit,
    .enable = drv_eth_enable,
    .disable = drv_eth_disable,
    .phy_init = drv_eth_phy_init,
    .phy_reset = drv_eth_phy_reset,
    .get_link_status = drv_eth_get_link_status,
    .restart_autoneg = drv_eth_restart_autoneg,
    .read_phy_reg = drv_eth_read_phy_reg,
    .write_phy_reg = drv_eth_write_phy_reg,
    .register_callback = drv_eth_register_callback,
    .write = drv_eth_write,
    .get_tcpip_init_done_fn = drv_eth_get_tcpip_init_done_fn_impl,
    .start_link_monitor = drv_eth_start_link_monitor_impl,
    .stop_link_monitor = drv_eth_stop_link_monitor_impl,
};

static drv_eth_status_t drv_eth_init(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    printf("[ETH] Initializing GMAC clocks and pins\r\n");
    
    // Initialize GMAC clocks first
    gmac_clock_init();
    
    // Configure GMAC pins
    gmac_pin_init();
    
    // Initialize MAC
    int32_t result = mac_async_init(context->mac_desc, GMAC);
    if (result != ERR_NONE) {
        return convert_error_code(result);
    }
    
    printf("[ETH] MAC initialized successfully\r\n");
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_deinit(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_deinit(context->mac_desc);
    printf("[ETH] MAC deinitialized\r\n");
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_enable(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_enable(context->mac_desc);
    if (result == ERR_NONE) {
        printf("[ETH] MAC enabled\r\n");
    }
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_disable(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_disable(context->mac_desc);
    printf("[ETH] MAC disabled\r\n");
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_phy_init(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    printf("[ETH] Initializing PHY\r\n");
    
    drv_phy_status_t result = hw_phy_init(context->phy_driver);
    if (result != DRV_PHY_STATUS_OK) {
        printf("[ETH] PHY initialization failed\r\n");
        return (drv_eth_status_t)result;
    }
    
    result = hw_phy_enable(context->phy_driver);
    if (result != DRV_PHY_STATUS_OK) {
        printf("[ETH] PHY enable failed\r\n");
        return (drv_eth_status_t)result;
    }
    
    printf("[ETH] PHY initialized successfully\r\n");
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_phy_reset(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    drv_phy_status_t result = hw_phy_reset(context->phy_driver);
    if (result == DRV_PHY_STATUS_OK) {
        printf("[ETH] PHY reset completed\r\n");
    }
    return (drv_eth_status_t)result;
}

static drv_eth_status_t drv_eth_get_link_status(const void *hw_context, bool *link_up)
{
    ASSERT(hw_context != NULL);
    ASSERT(link_up != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    drv_phy_status_t result = hw_phy_get_link_status(context->phy_driver, link_up);
    return (drv_eth_status_t)result;
}

static drv_eth_status_t drv_eth_restart_autoneg(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    drv_phy_status_t result = hw_phy_restart_autoneg(context->phy_driver);
    if (result == DRV_PHY_STATUS_OK) {
        printf("[ETH] Auto-negotiation restarted\r\n");
    }
    return (drv_eth_status_t)result;
}

static drv_eth_status_t drv_eth_read_phy_reg(const void *hw_context, uint16_t reg, uint16_t *value)
{
    ASSERT(hw_context != NULL);
    ASSERT(value != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    drv_phy_status_t result = hw_phy_read_reg(context->phy_driver, reg, value);
    return (drv_eth_status_t)result;
}

static drv_eth_status_t drv_eth_write_phy_reg(const void *hw_context, uint16_t reg, uint16_t value)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    drv_phy_status_t result = hw_phy_write_reg(context->phy_driver, reg, value);
    return (drv_eth_status_t)result;
}

static drv_eth_status_t drv_eth_register_callback(const void *hw_context, drv_eth_cb_type_t type, drv_eth_callback_t callback)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    // Store callback for future use
    if (type == DRV_ETH_CB_RECEIVE) {
        context->receive_callback = callback;
        // Register with ASF4 MAC
        int32_t result = mac_async_register_callback(context->mac_desc, MAC_ASYNC_RECEIVE_CB, (FUNC_PTR)callback);
        return convert_error_code(result);
    } else if (type == DRV_ETH_CB_TRANSMIT) {
        context->transmit_callback = callback;
        // Register with ASF4 MAC  
        int32_t result = mac_async_register_callback(context->mac_desc, MAC_ASYNC_TRANSMIT_CB, (FUNC_PTR)callback);
        return convert_error_code(result);
    }
    
    return DRV_ETH_STATUS_ERROR;
}

static drv_eth_status_t drv_eth_write(const void *hw_context, const uint8_t *data, uint32_t length)
{
    ASSERT(hw_context != NULL);
    ASSERT(data != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_write(context->mac_desc, (uint8_t *)data, length);
    return convert_error_code(result);
}

/* GMAC hardware initialization functions */

static void gmac_clock_init(void)
{
    hri_mclk_set_AHBMASK_GMAC_bit(MCLK);
    hri_mclk_set_APBCMASK_GMAC_bit(MCLK);
    printf("[ETH] GMAC clocks enabled\r\n");
}

static void gmac_pin_init(void)
{
    gpio_set_pin_function(PC11, PINMUX_PC11L_GMAC_GMDC);
    gpio_set_pin_function(PC12, PINMUX_PC12L_GMAC_GMDIO);
    gpio_set_pin_function(PA13, PINMUX_PA13L_GMAC_GRX0);
    gpio_set_pin_function(PA12, PINMUX_PA12L_GMAC_GRX1);
    gpio_set_pin_function(PC20, PINMUX_PC20L_GMAC_GRXDV);
    gpio_set_pin_function(PA15, PINMUX_PA15L_GMAC_GRXER);
    gpio_set_pin_function(PA18, PINMUX_PA18L_GMAC_GTX0);
    gpio_set_pin_function(PA19, PINMUX_PA19L_GMAC_GTX1);
    gpio_set_pin_function(PA14, PINMUX_PA14L_GMAC_GTXCK);
    gpio_set_pin_function(PA17, PINMUX_PA17L_GMAC_GTXEN);
    printf("[ETH] GMAC pins configured\r\n");
}

/* GMAC and link monitoring functions moved from webserver_tasks.c */

static void mac_receive_cb(struct mac_async_descriptor *desc)
{
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    context->recv_flag = true;
}

/**
 * \brief Callback for GMAC interrupt.
 * Give semaphore for which gmac_task waits
 */
static void gmac_handler_cb(void)
{
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    BaseType_t xGMACTaskWoken = pdFALSE;
    
    /* Use ISR-safe semaphore give function */
    xSemaphoreGiveFromISR(context->gmac_dev.rx_sem.sem, &xGMACTaskWoken);
    
    /* Perform context switch if higher priority task was woken */
    portYIELD_FROM_ISR(xGMACTaskWoken);
}

/**
 * \brief Task for GMAC.
 * Waits for GMAC interrupt and begins processing of received packets
 */
static void gmac_task(void *pvParameters)
{
    gmac_device *ps_gmac_dev = pvParameters;

    while (1) {
        /* Wait for the counting RX notification semaphore. */
        sys_sem_wait(&ps_gmac_dev->rx_sem);

        /* Process the incoming packet. */
        ethernetif_mac_input(ps_gmac_dev->netif);
    }
}

/**
 * \brief Link monitoring task
 * Periodically checks PHY link status and notifies lwIP of changes
 */
static void link_monitor_task(void *p)
{
    (void)p;
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    bool current_link_state = false;
    bool previous_link_state = false;
    
    /* Wait for network initialization to complete */
    vTaskDelay(2000);
    
    /* Get initial link state */
    hw_eth_get_link_status(&eth_communication, &previous_link_state);
    
    for (;;) {
        /* Check current link status */
        drv_eth_status_t phy_result = hw_eth_get_link_status(&eth_communication, &current_link_state);
        if (phy_result == DRV_ETH_STATUS_OK) {
            /* Detect link status changes */
            if (current_link_state != previous_link_state) {
                printf("[LINK_MONITOR] Link state change detected: %s -> %s\r\n",
                       previous_link_state ? "UP" : "DOWN",
                       current_link_state ? "UP" : "DOWN");
                
                /* Update lwIP network interface link status */
                if (current_link_state) {
                    netif_set_link_up(&TCPIP_STACK_INTERFACE_0_desc);
                    printf("[LINK_MONITOR] Notified lwIP: Link UP\r\n");
                    
                    /* Don't restart auto-negotiation - let it stabilize naturally */
                    printf("[LINK_MONITOR] Link UP - allowing stabilization\r\n");
                } else {
                    netif_set_link_down(&TCPIP_STACK_INTERFACE_0_desc);
                    printf("[LINK_MONITOR] Notified lwIP: Link DOWN\r\n");
                }
                
                /* Update context link state */
                context->link_up = current_link_state;
                previous_link_state = current_link_state;
            }
        } else {
            printf("[LINK_MONITOR] Failed to read PHY link status (error: %d)\r\n", phy_result);
            
            /* Try to reinitialize PHY if we can't read it */
            static int phy_error_count = 0;
            phy_error_count++;
            if (phy_error_count >= 10) {  /* After 10 consecutive errors (5 seconds) */
                printf("[LINK_MONITOR] Attempting PHY re-initialization\r\n");
                hw_eth_phy_init(&eth_communication);
                phy_error_count = 0;
            }
        }
        
        /* Check link status every 500ms */
        vTaskDelay(500);
    }
}

/* TCP/IP stack initialization done callback - moved from webserver_tasks.c */
static void eth_tcpip_init_done(void *arg)
{
    sys_sem_t *sem;
    sem = (sys_sem_t *)arg;
    u8_t mac[6] = {0x00, 0x00, 0x00, 0x00, 0x20, 0x76};
    
    /* Initialize network event logging */
    network_events_init();
    log_lwip_init(ERR_OK);
    
    hw_eth_register_callback(&eth_communication, DRV_ETH_CB_RECEIVE, gmac_handler_cb);
    hri_gmac_set_IMR_RCOMP_bit(COMMUNICATION_IO.dev.hw);

    printf("[INIT] Waiting for Ethernet link...\r\n");
    
    /* Initialize PHY before reading its status */
    drv_eth_status_t phy_init_status = hw_eth_phy_init(&eth_communication);
    if (phy_init_status != DRV_ETH_STATUS_OK) {
        printf("[INIT] PHY initialization failed: %d\r\n", phy_init_status);
    }
    
    /* Give PHY more time to initialize and establish link */
    int link_attempts = 0;
    const int max_link_attempts = 100;  /* 10 seconds at 100ms intervals */
    
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    
    while (link_attempts < max_link_attempts) {
        drv_eth_status_t phy_status = hw_eth_get_link_status(&eth_communication, &context->link_up);
        
        if (phy_status == DRV_ETH_STATUS_OK && context->link_up) {
            printf("[INIT] PHY link established after %d attempts\r\n", link_attempts);
            break;
        }
        
        if (phy_status != DRV_ETH_STATUS_OK) {
            printf("[INIT] PHY read error: %d (attempt %d)\r\n", phy_status, link_attempts);
        } else {
            printf("[INIT] PHY link still down (attempt %d)\r\n", link_attempts);
        }
        
        link_attempts++;
        vTaskDelay(100);  /* Wait 100ms between attempts */
    }
    
    if (!context->link_up) {
        printf("[INIT] WARNING: PHY link not established after %d attempts\r\n", max_link_attempts);
        printf("[INIT] Continuing with network stack initialization...\r\n");
    }

    printf("[INIT] Ethernet link detected\r\n");

    /* Enable NVIC GMAC interrupt. */
    /* Interrupt priorities. (lowest value = highest priority) */
    /* ISRs using FreeRTOS *FromISR APIs must have priorities below or equal to */
    /* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY. */
    /* Setting to 5 (numerically higher than 4, so lower priority) */
    NVIC_SetPriority(GMAC_IRQn, 5);
    NVIC_EnableIRQ(GMAC_IRQn);
    mac_async_enable(&COMMUNICATION_IO);

    printf("[INIT] Initializing network interface...\r\n");
    TCPIP_STACK_INTERFACE_0_init(mac);

    TCPIP_STACK_INTERFACE_0_desc.input = tcpip_input;

    context->gmac_dev.netif = &TCPIP_STACK_INTERFACE_0_desc;

    /* Incoming packet notification semaphore. */
    if (sys_sem_new(&context->gmac_dev.rx_sem, 0) != ERR_OK) {
        LWIP_ASSERT("Failed to create semaphore", 0);
    }

    sys_thread_t id = sys_thread_new("GMAC", gmac_task, &context->gmac_dev, netifINTERFACE_TASK_STACK_SIZE, netifINTERFACE_TASK_PRIORITY);
    LWIP_ASSERT("ethernetif_init: GMAC Task allocation ERROR!\n", (id != 0));
    (void)id;  /* Suppress unused variable warning after assertion */

    printf("[INIT] Setting up network interface callbacks...\r\n");
    netif_set_default(&TCPIP_STACK_INTERFACE_0_desc);
    
    /* Register network event callbacks */
    netif_set_status_callback(&TCPIP_STACK_INTERFACE_0_desc, netif_status_callback);
    netif_set_link_callback(&TCPIP_STACK_INTERFACE_0_desc, netif_link_callback);
    
    /* Log initial MAC address */
    log_mac_address(&TCPIP_STACK_INTERFACE_0_desc);
    
    /* Log initial link status */
    log_link_status_change(&TCPIP_STACK_INTERFACE_0_desc, context->link_up);
    
    /* Manually update lwIP link status since link monitoring task hasn't started yet */
    if (context->link_up) {
        printf("[INIT] Setting initial link status to UP in lwIP\r\n");
        netif_set_link_up(&TCPIP_STACK_INTERFACE_0_desc);
    } else {
        printf("[INIT] Setting initial link status to DOWN in lwIP\r\n");
        netif_set_link_down(&TCPIP_STACK_INTERFACE_0_desc);
    }

#if CONF_TCPIP_STACK_INTERFACE_0_DHCP
    /* DHCP mode. */
    printf("[INIT] Starting DHCP client...\r\n");
    if (ERR_OK != dhcp_start(&TCPIP_STACK_INTERFACE_0_desc)) {
        log_dhcp_error(&TCPIP_STACK_INTERFACE_0_desc, "Failed to start DHCP client");
        LWIP_ASSERT("ERR_OK != dhcp_start", 0);
    } else {
        printf("[DHCP] Client started successfully\r\n");
    }
#else
    printf("[INIT] Using static IP configuration...\r\n");
    netif_set_up(&TCPIP_STACK_INTERFACE_0_desc);
    log_network_config(&TCPIP_STACK_INTERFACE_0_desc);
#endif

    printf("[INIT] Network initialization complete\r\n");
    sys_sem_signal(sem); /* Signal the waiting thread that the TCP/IP init is done. */
}

static drv_eth_tcpip_init_done_fn drv_eth_get_tcpip_init_done_fn_impl(const void *hw_context)
{
    return eth_tcpip_init_done;
}

/**
 * \brief Start link monitoring task
 */
static drv_eth_status_t drv_eth_start_link_monitor_impl(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    if (context->link_monitor_task != NULL) {
        printf("[ETH] Link monitor task already running\r\n");
        return DRV_ETH_STATUS_OK;
    }
    
    /* Create task to monitor link status */
    if (xTaskCreate(link_monitor_task, "LinkMon", TASK_LED_STACK_SIZE, NULL, TASK_LED_TASK_PRIORITY, &context->link_monitor_task) != pdPASS) {
        printf("[ETH] Failed to create link monitor task\r\n");
        return DRV_ETH_STATUS_ERROR;
    }
    
    printf("[ETH] Link monitor task started\r\n");
    return DRV_ETH_STATUS_OK;
}

/**
 * \brief Stop link monitoring task
 */
static drv_eth_status_t drv_eth_stop_link_monitor_impl(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    if (context->link_monitor_task != NULL) {
        vTaskDelete(context->link_monitor_task);
        context->link_monitor_task = NULL;
        printf("[ETH] Link monitor task stopped\r\n");
    }
    
    return DRV_ETH_STATUS_OK;
}